
### :robot: Terraform Report
---
##### Plan: `1` to add, `1` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_secret_manager_secret.alloydb will be updated in-place
  ~ resource "google_secret_manager_secret" "alloydb" {
      ~ annotations           = {
          - "password" = "YoongeeD7Ai" -> null
            # (1 unchanged element hidden)
        }
      ~ effective_annotations = {
          - "password" = "YoongeeD7Ai" -> null
            # (1 unchanged element hidden)
        }
        id                    = "projects/maestro-intelligence/secrets/alloydbsecret"
        name                  = "projects/300912054443/secrets/alloydbsecret"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_secret_manager_secret_version.alloydbpassword will be created
  + resource "google_secret_manager_secret_version" "alloydbpassword" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = "projects/maestro-intelligence/secrets/alloydbsecret"
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#12279823471`](https://github.com/lessthan3/personalization/actions/runs/12279823471) - commit f1f9058967b6247f4adf4cb288d6075a0746c01a
